app/views/users/_follow-list.html.erb

            <td class="pl-5"><%= user.name %></td>
            <td>フォロー数:<%= Relationship.where(follower: user).count %></td>
            <td>フォロワー数:<%= Relationship.where(followed: user).count %></td>
---
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 1]]
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."followed_id" = ?  [["followed_id", 1]]