app/views/books/_list.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 1], ["LIMIT", 1]]
---
          <span class="favorite-button">
            <% if Favorite.find_by(user_id: current_user.id, book_id: book.id) %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
          <span class="count">
            <% if Favorite.where(book_id: book).count != 0 %>
              <%= Favorite.where(book_id: book).count %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
---
        <td>
          <% if Comment.where(book_id: book.id).count != 0 %>
            <%= Comment.where(book_id: book.id).count %><i class="fas fa-comments"></i>