app/views/books/_side.html.erb

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 1]]
---
          <%= link_to user_follows_path(@user) do %>
            <%= Relationship.where(follower: @user).count %>

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."followed_id" = ?  [["followed_id", 1]]
---
          <%= link_to user_followers_path(@user) do %>
            <%= Relationship.where(followed: @user).count %>

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."follower_id" = ?  [["follower_id", 3]]
---
          <%= link_to user_follows_path(current_user) do %>
            <%= Relationship.where(follower: current_user).count %>

SELECT COUNT(*) FROM "relationships" WHERE "relationships"."followed_id" = ?  [["followed_id", 3]]
---
          <%= link_to user_followers_path(current_user) do %>
            <%= Relationship.where(followed: current_user).count %>