app/views/books/show.html.erb

        <div class="comments-count mx-5 pt-2">
          コメント数<i class="fas fa-comments"></i>：<%= Comment.where(book_id: @book.id).count %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]