app/views/books/show.html.erb

      <!--  <span class="favorite-bottun">-->
      <!--    <% if Favorite.find_by(user_id: current_user.id, book_id: @book.id) %>-->
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 1], ["LIMIT", 1]]

      <!--  <span class="count">-->
      <!--    <% if Favorite.where(book_id: @book).count != 0 %>-->
      <!--      <%= Favorite.where(book_id: @book).count %>-->
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

      <!--    <span class="bg-light text-dark ml-2">-->
      <!--      <% Favorite.where(book_id: @book).each do |favo| %>-->
      <!--        <i class="fas fa-heart"></i><%= User.find_by(id: favo.user_id).name %>-->
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

      <!--    <h3 class="border-bottom w-50">comments</h3>-->
      <!--    <% if Comment.find_by(book_id: params[:id]) %>-->
---
SELECT  "comments".* FROM "comments" WHERE "comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]