app/controllers/books_controller.rb

  def index
    @books = Book.page(params[:page]).reverse_order.per(7)
---
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]

  def show
    @book = Book.find(params[:id])
    @user = User.find_by(id: @book.user_id)
    @comments = Comment.where(book_id: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]