app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def ensure_correct_user
    if current_user.id != Comment.find(params[:id]).user_id && current_user.id != Book.find(params[:book_id]).user_id

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "投稿テストです"], ["user_id", 3], ["book_id", 1], ["created_at", "2021-02-01 10:20:44.772065"], ["updated_at", "2021-02-01 10:20:44.772065"]]
---
  def create
    @book = Book.find(params[:book_id])
    @comments = Comment.where(book_id: params[:book_id])
    @comment = Comment.new
    comment = Comment.new(comment_params)
    comment.user_id = current_user.id
    comment.book_id = params[:book_id]
    if comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? AND "comments"."book_id" = ? LIMIT ?  [["id", 2], ["book_id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @book = Book.find(params[:book_id])
    @comments = Comment.where(book_id: params[:book_id])
    @comment = Comment.new
    comment = Comment.find_by(id: params[:id], book_id: params[:book_id])
    if comment.delete