app/controllers/favorites_controller.rb

  def create
    @book = Book.find_by(id: params[:book_id])
    @favorite = Favorite.new(user_id: current_user.id, book_id: params[:book_id])
    if @favorite.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["book_id", 1], ["created_at", "2021-02-01 10:19:32.255081"], ["updated_at", "2021-02-01 10:19:32.255081"]]

  def destroy
    @book = Book.find_by(id: params[:book_id])
    @favorite = Favorite.find_by(user_id: current_user.id, book_id: params[:book_id])
    if @favorite.delete
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 3], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]